app/controllers/authors_controller.rb

INSERT INTO "authors" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 17 Mar 2013 16:01:21 UTC +00:00], ["name", "Silvio"], ["updated_at", Sun, 17 Mar 2013 16:01:21 UTC +00:00]]
---
  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save