app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 17 Mar 2013 16:01:09 UTC +00:00], ["name", "JJR"], ["updated_at", Sun, 17 Mar 2013 16:01:09 UTC +00:00]]
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save