app/controllers/tasks_controller.rb

  def index
    @tasks = Task.order("status DESC")
---
SELECT "tasks".* FROM "tasks" ORDER BY status DESC

  def new
    @task = Task.new
    @authors = Author.all
    @categories = Category.all
---
SELECT "authors".* FROM "authors"
SELECT "categories".* FROM "categories"

  def edit
    @task = Task.find(params[:id])
    @authors = Author.all
    @categories = Category.all
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "authors".* FROM "authors"
SELECT "categories".* FROM "categories"

  def create
    @task = Task.new(params[:task])
    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("author_id", "category_id", "created_at", "description", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author_id", 1], ["category_id", 1], ["created_at", Sun, 17 Mar 2013 17:54:39 UTC +00:00], ["description", "Erro "], ["status", "Pendente"], ["updated_at", Sun, 17 Mar 2013 17:54:39 UTC +00:00]]

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tasks" SET "status" = 'Concluido', "updated_at" = '2013-03-17 17:54:58.632838' WHERE "tasks"."id" = 1